# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [18]:
sr1 = pd.Series(np.random.randint(1, 5, size=(100,), dtype='l'))
sr2 = pd.Series(np.random.randint(1, 4, size=(100,)), dtype='l')
sr3 = pd.Series(np.random.randint(10000, 30001, size=(100,)), dtype='l')

### Step 3. Let's create a DataFrame by joinning the Series by column

In [12]:
df = pd.concat([sr1, sr2, sr3], axis=1)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [20]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       2       2            15682
1       3       3            16915
2       3       1            12862
3       2       1            10643
4       1       2            23882
..    ...     ...              ...
95      1       2            26183
96      3       2            26512
97      2       2            26853
98      2       1            12372
99      4       2            22878

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [22]:
bigcolumn = pd.concat([sr1, sr2, sr3])
bigcolumn.to_frame()

        0
0       4
1       4
2       1
3       4
4       3
..    ...
95  17423
96  23171
97  28818
98  24558
99  16145

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [23]:
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [25]:
bigcolumn.reset_index(drop=True)

0          4
1          4
2          1
3          4
4          3
       ...
295    17423
296    23171
297    28818
298    24558
299    16145
Length: 300, dtype: int64